import pygame
# Square 12x12
map = [  # map formula
    ["_", "_", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "_", "_", "_", "A", "A", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "_", "_", "_", "A", "A", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "A", "_", "_", "_", "A", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "_", "_", "_", "A", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "_", "_", "_", "_", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "_", "_", "_", "_", "_", "_", "A", "_", "_", "_", "_", "A" ,"A"],
    ["_", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A", "A" ,"A"],
]
# 3 рядку 3 колонку - "А", 11 рядок 3 колонка - "_"
# 1/12 window height
SIZE = 600 / 12
# A - wall, "-" - space
# row - рядок
def make_map():
    result = []
    for row in range(len(map)): # Для кожного зі списків
        for column in range(len(map[row])): # Для кожного елемента списку
            if map[row][column] == "A": # Якщо елемент - списку це A
                x = SIZE * (column + 0.5)
                y = SIZE * row
                # import pygame не забудьте
                result.append(pygame.Rect(x, y, SIZE, SIZE))
    return result
